; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_2 ?v6 - type_2 ?v7 - type_3)
 	      (pred_1 ?v8 - object ?v7 - type_3)
	      (pred_3 ?v6 - type_2 ?v4 - type_1)
	      (pred_4 ?v6 - type_2 ?v8 - object ?v4 - type_1))

   (:action op_1
       :parameters  (?v6 - type_2 ?v1 ?v5 - type_3)
       :precondition (and  (pred_2 ?v6 ?v1))
       :effect (and  (pred_2 ?v6 ?v5)
		     (not (pred_2 ?v6 ?v1))))

   (:action op_2
       :parameters (?v6 - type_2 ?v2 - object ?v3 - type_3 ?v4 - type_1)
       :precondition  (and  (pred_1 ?v2 ?v3) (pred_2 ?v6 ?v3) (pred_3 ?v6 ?v4))
       :effect (and (pred_4 ?v6 ?v2 ?v4)
		    (not (pred_1 ?v2 ?v3)) 
		    (not (pred_3 ?v6 ?v4))))

   (:action op_3
       :parameters (?v6 - type_2 ?v2 - object ?v3 - type_3 ?v4 - type_1)
       :precondition  (and  (pred_4 ?v6 ?v2 ?v4) (pred_2 ?v6 ?v3))
       :effect (and (pred_1 ?v2 ?v3)
		    (pred_3 ?v6 ?v4)
		    (not (pred_4 ?v6 ?v2 ?v4)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_10 obj_11 - type_2
obj_02 obj_08 obj_01 obj_06 - type_1
obj_04 obj_05 obj_09 - type_3
obj_07 obj_03 obj_12 - object)
(:init
(pred_2 obj_10 obj_04)
(pred_3 obj_10 obj_02)
(pred_3 obj_10 obj_08)
(pred_2 obj_11 obj_04)
(pred_3 obj_11 obj_01)
(pred_3 obj_11 obj_06)
(pred_1 obj_07 obj_05)
(pred_1 obj_03 obj_05)
(pred_1 obj_12 obj_09)
)
(:goal
(and
(pred_1 obj_07 obj_04)
(pred_1 obj_03 obj_09)
(pred_1 obj_12 obj_05)
)
)

(:constraints
  (always (not (pred_2 obj_10 obj_09)))
)
)

; plan
1. (op_1 obj_10 obj_04 obj_05)
   deleted: (pred_2 obj_10 obj_04)
   added: (pred_2 obj_10 obj_05)
   goals met: 0 of 3
2. (op_1 obj_11 obj_04 obj_05)
   deleted: (pred_2 obj_11 obj_04)
   added: (pred_2 obj_11 obj_05)
   goals met: 0 of 3
3. (op_2 obj_10 obj_03 obj_05 obj_08)
   deleted: (pred_1 obj_03 obj_05) (pred_3 obj_10 obj_08)
   added: (pred_4 obj_10 obj_03 obj_08)
   goals met: 0 of 3
4. (op_2 obj_11 obj_07 obj_05 obj_06)
   deleted: (pred_1 obj_07 obj_05) (pred_3 obj_11 obj_06)
   added: (pred_4 obj_11 obj_07 obj_06)
   goals met: 0 of 3
5. (op_1 obj_11 obj_05 obj_04)
   deleted: (pred_2 obj_11 obj_05)
   added: (pred_2 obj_11 obj_04)
   goals met: 0 of 3
6. (op_3 obj_10 obj_03 obj_05 obj_08)
   deleted: (pred_4 obj_10 obj_03 obj_08)
   added: (pred_1 obj_03 obj_05) (pred_3 obj_10 obj_08)
   goals met: 0 of 3
7. (op_3 obj_11 obj_07 obj_04 obj_06)
   deleted: (pred_4 obj_11 obj_07 obj_06)
   added: (pred_1 obj_07 obj_04) (pred_3 obj_11 obj_06)
   goals met: 1 of 3
8. (op_1 obj_11 obj_04 obj_09)
   deleted: (pred_2 obj_11 obj_04)
   added: (pred_2 obj_11 obj_09)
   goals met: 1 of 3
9. (op_2 obj_11 obj_12 obj_09 obj_06)
   deleted: (pred_1 obj_12 obj_09) (pred_3 obj_11 obj_06)
   added: (pred_4 obj_11 obj_12 obj_06)
   goals met: 1 of 3
10. (op_1 obj_11 obj_09 obj_05)
   deleted: (pred_2 obj_11 obj_09)
   added: (pred_2 obj_11 obj_05)
   goals met: 1 of 3
11. (op_3 obj_11 obj_12 obj_05 obj_06)
   deleted: (pred_4 obj_11 obj_12 obj_06)
   added: (pred_1 obj_12 obj_05) (pred_3 obj_11 obj_06)
   goals met: 2 of 3
12. (op_2 obj_11 obj_03 obj_05 obj_06)
   deleted: (pred_1 obj_03 obj_05) (pred_3 obj_11 obj_06)
   added: (pred_4 obj_11 obj_03 obj_06)
   goals met: 2 of 3
13. (op_1 obj_11 obj_05 obj_09)
   deleted: (pred_2 obj_11 obj_05)
   added: (pred_2 obj_11 obj_09)
   goals met: 2 of 3
14. (op_3 obj_11 obj_03 obj_09 obj_06)
   deleted: (pred_4 obj_11 obj_03 obj_06)
   added: (pred_1 obj_03 obj_09) (pred_3 obj_11 obj_06)
   goals met: 3 of 3
